import streamlit as st
import folium
from streamlit_folium import st_folium
import time

st.set_page_config(layout='wide')
st.markdown("""
<style>
body, [data-testid="stMarkdownContainer"] {
    direction: rtl;
    text-align: right;
    font-family: "Cairo", "Tahoma", sans-serif;
}
</style>
""", unsafe_allow_html=True)

def about () :
    txt =  """
🌟 مرحباً بكم في شركة الفاتح بالله للاستثمار العقاري والاستشارات العقارية في مصر 🌟\n
يسعدنا أن نرحّب بكم أجمل ترحيب في شركتكم التي تسعى دوماً إلى تقديم أرقى الخدمات العقارية على امتداد أرض الكنانة.
نضع بين أيديكم خبرةً واسعة في مجال الاستثمار العقاري، وإدارة المشروعات، وتقديم الاستشارات المتخصّصة، لنكون شركاء نجاحكم في كل خطوةٍ على طريق التميّز والريادة.   
    """.strip()
    for i in txt.split(" ") :
        yield  i + " "
        time.sleep(0.02)

# def position():
#     address = """
#     مصر - القاهره - العبور الحي الاول -  بجوار محطه الكهرباء
#     """.strip()
#     address_list =  address.split(" ")
#     for i  in address.split(" ") :
#         yield  i + " "
#         time.sleep(0.02)

@st.fragment
def go_button(page) :
    st.markdown("""
        <style>
            .button-container {
                display: flex;
                flex-direction: column;
                justify-content: flex-end;  /* المحاذاة للأسفل */
                height: 100%;
                color : blue;
            }
        </style>
        """, unsafe_allow_html=True)
    st.markdown('<div class="button-container">', unsafe_allow_html=True)

    if st.button('تصفح العقارات ', use_container_width=True):
        pass


col1, col2, col3 =  st.columns([1,4,1],)

with col1 :
    st.image(r"image/image3.png")

with col2 :
    st.markdown("""
        <style>
        /* نخلي شريط التبويبات بالنص */
        div[data-baseweb="tab-list"] {
            justify-content: center !important;
        }

        /* نخلي العناوين نفسها فيها مسافة مريحة */
        button[data-baseweb="tab"] {
            margin: 0 50px !important;       /* مسافة يمين ويسار بين التبويبات */
            font-weight: 600 !important;     /* خط عريض شوي */
            font-size: 30px !important;      /* حجم أكبر شوي لو بدك */
        }
        </style>
        """, unsafe_allow_html=True)
    tabs = st.tabs(['موقعنا', 'من نحن', 'خدماتنا'], default='من نحن')

with col3 :
    go_button('page')


with tabs[0] :
    address, map = st.columns(2)
    with address:
        st.write('* مصر ---  القاهره  ---  العبور ---  الحي الاول  --- بجوار الغاز')
        st.write('* رقم التواصل الخاص بنا :: 1153148401  20+ ')
        st.write('* كما ويمكن زيارتنا والتواصل معنا عبر صفحتنا على الفيس بوك ')
        st.link_button('زور صفحتنا على فيسبوك', url='https://www.facebook.com/profile.php?id=61582944038227')
    with map :
        m = folium.Map(location=[30.25217, 31.47629], zoom_start=15)
        folium.Marker(
                location=[30.25217, 31.47629],
                popup="شارع نعمان جمعه",
                tooltip="عرض العنوان"
            ).add_to(m)

        st_folium(m, width=500, height=250)

with tabs[1]:
    st.write_stream(about())


with tabs[2] :
    st.markdown("""
    ### الخدمات التي نقدمها:
    - ✅ البحث عن العقار المناسب (سكني – تجاري – استثماري).
    - ✅ تدقيق قانوني كامل لكل عقار قبل الشراء، بخبرة محامي مصري.
    - ✅ إتمام البيع والشراء رسميًا بخطوات موثقة بالكامل:
      - في حالة الأراضي: 
          - يتم عمل توكيل بيع وتوكيل إدارة في الشهر العقاري، ثم عقد بيع نهائي موثق.
      - في حالة الشقق: 
          - نفحص أوراق الملكية والتوكيل الأصلي بعدها نوقع عقد البيع النهائي وبنقوم بعمل صحة توقيع في المحكمة لضمان المشتري بالكامل.
    - ✅ إصدار تراخيص البناء للأراضي الجديدة بالتعاون مع جهاز المدينة ، ونتابع كل ما يخص الرخص والرسومات الهندسية خطوة بخطوة.
    - ✅ إرسال تقارير وفيديوهات تفصيلية للمشتري في غزة أثناء كل مرحلة.
    - ✅ إدارة العقار بعد الشراء (تأجير، متابعة فواتير، صيانة...) مقابل نسبة بسيطة.
    - ✅ فرص استثمارية حقيقية في مشاريع قائمة وجاهزة للعائد الشهري.
    """)